saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MKL26Z4_DFP.10.0.3.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USART" Cversion="2.0.0" Csub="lpsci_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MKL26Z4_driver.lpsci">
      <description>LPSCI CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_lpsci_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_lpsci_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Cversion="2.0.0" Csub="spi_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MKL26Z4_driver.spi">
      <description>SPI CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_spi_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_spi_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Cversion="2.0.0" Csub="uart_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MKL26Z4_driver.uart">
      <description>UART CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_uart_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_uart_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="adc" condition="device.MKL26Z4_driver.common">
      <description>ADC16 Driver</description>
      <files>
        <file name="drivers/fsl_adc16.c" category="sourceC"/>
        <file name="drivers/fsl_adc16.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.0" Csub="clock" condition="device.MKL26Z4_driver.common">
      <description>Clock Driver</description>
      <files>
        <file name="drivers/fsl_clock.c" category="sourceC"/>
        <file name="drivers/fsl_clock.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="cmp" condition="device.MKL26Z4_driver.common">
      <description>CMP Driver</description>
      <files>
        <file name="drivers/fsl_cmp.c" category="sourceC"/>
        <file name="drivers/fsl_cmp.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="common" condition="device.MKL26Z4_driver.common">
      <description>COMMON Driver</description>
      <files>
        <file name="drivers/fsl_common.c" category="sourceC"/>
        <file name="drivers/fsl_common.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="cop" condition="device.MKL26Z4_driver.common">
      <description>COP Driver</description>
      <files>
        <file name="drivers/fsl_cop.c" category="sourceC"/>
        <file name="drivers/fsl_cop.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="dac" condition="device.MKL26Z4_driver.common">
      <description>DAC Driver</description>
      <files>
        <file name="drivers/fsl_dac.c" category="sourceC"/>
        <file name="drivers/fsl_dac.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="dma" condition="device.MKL26Z4_driver.common_driver.dmamux">
      <description>DMA Driver</description>
      <files>
        <file name="drivers/fsl_dma.c" category="sourceC"/>
        <file name="drivers/fsl_dma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="dmamux" condition="device.MKL26Z4_driver.common">
      <description>DMAMUX Driver</description>
      <files>
        <file name="drivers/fsl_dmamux.c" category="sourceC"/>
        <file name="drivers/fsl_dmamux.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="3.0.0" Csub="flash" condition="device.MKL26Z4">
      <description>Flash Driver</description>
      <files>
        <file name="drivers/fsl_flash.h" category="header"/>
        <file name="drivers/fsl_ftfx_adapter.h" category="header"/>
        <file name="drivers/fsl_ftfx_cache.c" category="sourceC"/>
        <file name="drivers/fsl_ftfx_cache.h" category="header"/>
        <file name="drivers/fsl_ftfx_controller.c" category="sourceC"/>
        <file name="drivers/fsl_ftfx_controller.h" category="header"/>
        <file name="drivers/fsl_ftfx_features.h" category="header"/>
        <file name="drivers/fsl_ftfx_flash.c" category="sourceC"/>
        <file name="drivers/fsl_ftfx_flash.h" category="header"/>
        <file name="drivers/fsl_ftfx_flexnvm.c" category="sourceC"/>
        <file name="drivers/fsl_ftfx_flexnvm.h" category="header"/>
        <file name="drivers/fsl_ftfx_utilities.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.1" Csub="gpio" condition="device.MKL26Z4_driver.common">
      <description>GPIO Driver</description>
      <files>
        <file name="drivers/fsl_gpio.c" category="sourceC"/>
        <file name="drivers/fsl_gpio.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.5" Csub="i2c" condition="device.MKL26Z4_driver.common">
      <description>I2C Driver</description>
      <files>
        <file name="drivers/fsl_i2c.c" category="sourceC"/>
        <file name="drivers/fsl_i2c.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.5" Csub="i2c_dma" condition="device.MKL26Z4_driver.dma_driver.i2c">
      <description>I2C Driver</description>
      <files>
        <file name="drivers/fsl_i2c_dma.c" category="sourceC"/>
        <file name="drivers/fsl_i2c_dma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="llwu" condition="device.MKL26Z4_driver.common">
      <description>LLWU Driver</description>
      <files>
        <file name="drivers/fsl_llwu.c" category="sourceC"/>
        <file name="drivers/fsl_llwu.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.4" Csub="lpsci" condition="device.MKL26Z4_driver.common">
      <description>LPSCI Driver</description>
      <files>
        <file name="drivers/fsl_lpsci.c" category="sourceC"/>
        <file name="drivers/fsl_lpsci.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.4" Csub="lpsci_dma" condition="device.MKL26Z4_driver.dma_driver.lpsci">
      <description>LPSCI Driver</description>
      <files>
        <file name="drivers/fsl_lpsci_dma.c" category="sourceC"/>
        <file name="drivers/fsl_lpsci_dma.h" category="header"/>
      </files>
    </component>
